## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # kubernetes_secret.digital-ocean-secret will be created
+   resource "kubernetes_secret" "digital-ocean-secret" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "kubernetes.io/opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "digital-ocean-secret"
+           namespace        = "cert-manager"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.argocd.module.argocd_redis.module.argocd_redis[0].kubernetes_service_account.redis_service_account will be updated in-place
!   resource "kubernetes_service_account" "redis_service_account" {
        id                              = "kube-argocd/argocd-redis"
        # (1 unchanged attribute hidden)

-       secret {
-           name = "argocd-redis-token-gvbnk" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
